{
  "backend/main.mo": "Defines core backend actor with storage, authorization, and data models for users, posts, stories, messages, notifications, and announcements.",
  "feature_evidence.json": "Lists feature evidence items mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries of many frontend files for build or documentation use.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes using OKLCH color values.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app setup including router configuration, authentication gating, startup flow, and layout routing.",
  "frontend/src/components/announcements/AnnouncementsBanner.tsx": "Displays the latest announcement in a styled glassmorphic banner using fetched announcements.",
  "frontend/src/components/posts/CommentsDrawer.tsx": "Drawer UI for viewing and submitting comments on a post, including comment list, input form, and author profile lookup.",
  "frontend/src/components/posts/CreatePostDialog.tsx": "Modal dialog for creating a post with text and optional image or video upload, including preview and upload progress.",
  "frontend/src/components/posts/CreatePostFab.tsx": "Floating action button that triggers opening the create-post dialog.",
  "frontend/src/components/posts/FeedList.tsx": "Fetches and displays the full feed of posts with loading states, error handling, and a refresh button.",
  "frontend/src/components/posts/MediaPost.tsx": "Displays post media with support for images or auto-playing videos, including loading skeletons and play controls.",
  "frontend/src/components/posts/PostCard.tsx": "Renders an individual post with author info, media, likes, comments drawer toggle, deletion, and navigation to profiles.",
  "frontend/src/components/posts/TrendingPostsSection.tsx": "Empty placeholder component for a trending posts section.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Modal dialog for editing user profile details and profile picture with validation and upload progress.",
  "frontend/src/components/stories/CreateStoryDialog.tsx": "Modal form for creating a story with caption, optional image upload, preview, and progress handling.",
  "frontend/src/components/stories/StoriesRow.tsx": "Displays horizontally scrollable story bubbles grouped by author and includes a create-story button and dialog.",
  "frontend/src/components/system/ErrorBoundary.tsx": "React error boundary that shows a styled fallback UI and allows resetting to home on error.",
  "frontend/src/components/system/GlassSurface.tsx": "Provides glass-effect container components with variant-based styling.",
  "frontend/src/components/system/NavIcon.tsx": "Renders an image icon with automatic fallback to lucide icons on load failure.",
  "frontend/src/components/system/PageState.tsx": "Shared components for loading, error, empty, and skeleton UI states.",
  "frontend/src/components/system/PageTransition.tsx": "Wraps pages with a fade‑in animation keyed by route path.",
  "frontend/src/components/system/RoleBadge.tsx": "Displays styled owner or admin role badges with icons.",
  "frontend/src/components/system/SplashScreen.tsx": "Animated full‑screen splash screen showing logo and app name.",
  "frontend/src/components/system/StartupScreen.tsx": "Shows startup loading phases or an error card with retry option.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor based on identity, auto‑refreshing dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, posts, interactions, and search data via the backend actor.",
  "frontend/src/index.css": "Sets global Tailwind-based dark theme with custom OKLCH colors and premium glassmorphism and gradient utility classes.",
  "frontend/src/layout/AppShell.tsx": "Implements the main app layout with navigation, user profile data, unread notifications, and periodic last-seen updates.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard providing user management, post moderation, activity stats, and announcement creation.",
  "frontend/src/pages/auth/AuthGate.tsx": "Determines whether to show login, signup, or profile setup based on authentication and user profile state.",
  "frontend/src/pages/auth/LoginPage.tsx": "Login screen using Internet Identity with loading states, error handling, and a signup switch.",
  "frontend/src/pages/auth/ProfileSetupPage.tsx": "Form for completing user profile with name, class, and year, submitting data through an actor and refreshing profile state.",
  "frontend/src/pages/auth/SignupPage.tsx": "Signup screen that triggers Internet Identity login and displays errors or loading state.",
  "frontend/src/pages/home/HomePage.tsx": "Home feed page showing posts and a button to open the create-post dialog.",
  "frontend/src/pages/messages/ConversationPage.tsx": "Conversation view that loads messages with a user, marks them read, and allows sending new messages.",
  "frontend/src/pages/messages/MessagesPage.tsx": "Lists all conversations with previews and navigation to individual message threads.",
  "frontend/src/pages/notifications/NotificationsPage.tsx": "Displays user notifications, marking them as read when clicked.",
  "frontend/src/pages/onboarding/OnboardingPage.tsx": "Multi-step onboarding slideshow that tracks progress and completes onboarding on final step.",
  "frontend/src/pages/profile/ProfilePage.tsx": "Displays a user's profile with avatar, role badge, bio, posts, and edit or message actions depending on ownership.",
  "frontend/src/pages/search/SearchPage.tsx": "Provides a debounced user search interface showing matching profiles with navigation to messages or profiles.",
  "frontend/src/pages/settings/SettingsPage.tsx": "Renders user settings including profile info, appearance theme switching, admin role management, and logout handling.",
  "frontend/src/pages/stories/StoriesPage.tsx": "Lists active stories, allows creating new ones, and navigates to story viewer pages.",
  "frontend/src/pages/stories/StoryViewerPage.tsx": "Displays a full-screen story viewer with timed progression, navigation controls, and author info.",
  "frontend/src/utils/onboarding.ts": "Manages localStorage flags for tracking whether onboarding has been completed.",
  "frontend/src/utils/startup.ts": "Provides timeout utilities and logging helpers for tracking and debugging app startup phases.",
  "frontend/src/utils/time.ts": "Formats timestamps into relative time strings and determines online status based on activity timestamps.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the hash; supports both query and hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, fonts, shadows, and plugins for the app’s UI theme.",
  "project_state.json": "Stores project state, including known UI issues, required assets, requested fixes, and feature metadata for navigation icons, owner badge, and app logo updates."
}