{
  "backend/main.mo": "Defines core social-media backend types and state for users, posts, stories, messages, notifications, and announcements with mixin-based storage and authorization.",
  "feature_evidence.json": "Lists evidence mapping files and components to a deployment promotion feature with high-confidence verification metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and behavior of various frontend source files.",
  "frontend/DEPLOYMENT.md": "Documentation detailing how to promote draft builds to live, manage service worker cache versions, and verify deployments.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color tokens, dark-mode variables, and base element styling.",
  "frontend/index.html": "HTML entry point configuring metadata, PWA manifest links, icons, and mounting the root app script.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, start URL, theme colors, and icon assets.",
  "frontend/public/sw.js": "Service worker handling caching, versioning, activation, and offline fallback behavior for the PWA.",
  "frontend/src/App.tsx": "Main React app router defining authenticated routes, shell layout, and startup logic integration.",
  "frontend/src/components/announcements/AnnouncementsBanner.tsx": "Component that fetches and displays the latest announcement inside a styled glass card.",
  "frontend/src/components/posts/CommentsDrawer.tsx": "Renders a side drawer to view and submit comments on a post, including comment input, listing, and author info fetching.",
  "frontend/src/components/posts/CreatePostDialog.tsx": "Provides a dialog for creating posts with text and optional media upload, including previews and upload progress.",
  "frontend/src/components/posts/CreatePostFab.tsx": "Floating action button that triggers opening the create-post dialog.",
  "frontend/src/components/posts/FeedList.tsx": "Fetches and displays the list of posts with loading, error, empty states, and a refresh option.",
  "frontend/src/components/posts/MediaPost.tsx": "Displays image or video media with loading skeletons and auto-play controls for videos.",
  "frontend/src/components/posts/PostCard.tsx": "Shows an individual post with author info, content, media, like/delete actions, and comments drawer.",
  "frontend/src/components/posts/TrendingPostsSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Dialog for editing user profile fields and uploading a new profile picture with validation and progress tracking.",
  "frontend/src/components/stories/CreateStoryDialog.tsx": "Modal form for creating a story with caption, image upload, preview, and upload progress using useCreateStory.",
  "frontend/src/components/stories/StoriesRow.tsx": "Displays a horizontally scrollable list of story bubbles grouped by author and includes a create-story button.",
  "frontend/src/components/system/ErrorBoundary.tsx": "Class-based error boundary that shows a styled fallback UI and allows resetting to the home page.",
  "frontend/src/components/system/GlassSurface.tsx": "Reusable glass-style container components with variant-based styling for default, card, and navigation surfaces.",
  "frontend/src/components/system/NavIcon.tsx": "Renders an image-based nav icon with automatic fallback to lucide-react icons if loading fails.",
  "frontend/src/components/system/PageState.tsx": "Common UI states including loading indicator, error card with retry, empty state, and card skeleton placeholders.",
  "frontend/src/components/system/PageTransition.tsx": "Wraps page content with a fade‑in animation keyed to the current route path.",
  "frontend/src/components/system/RoleBadge.tsx": "Displays animated badges for admin or owner roles using themed colors and icons.",
  "frontend/src/components/system/SplashScreen.tsx": "Full‑screen animated splash screen with gradient effects, logo, and app branding.",
  "frontend/src/components/system/StartupScreen.tsx": "Shows app startup progress with phase‑specific icons and labels, plus an error screen with retry handling.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, reinitializing and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking. Wraps AuthClient creation and exposes identity state to the app.",
  "frontend/src/hooks/usePatchedActor.ts": "Creates a backend actor tied to the current identity using react-query and refreshes dependent queries when the actor changes. Falls back to an anonymous actor when unauthenticated.",
  "frontend/src/hooks/useQueries.ts": "Defines reusable react-query hooks for fetching and mutating user profiles, admin status, search results, and other backend data using the patched actor. Handles authentication state, retries, and conditional query enabling.",
  "frontend/src/index.css": "Configures Tailwind and defines a premium dark-theme design system with custom colors, gradients, and glassmorphism utility classes.",
  "frontend/src/layout/AppShell.tsx": "Renders the main app layout with navigation, user profile data, unread notifications, and periodic last‑seen updates. Builds navigation items dynamically using the authenticated identity.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in react-query and Internet Identity providers. Loads global styles and renders the root component.",
  "frontend/src/pages/access/AccessCodeGatePage.tsx": "Implements an access code gate UI that validates a code before unlocking the app. Handles form input, error display, and unlocking logic.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing user and post management tools, activity stats, and announcement creation using various backend mutations.",
  "frontend/src/pages/auth/AuthGate.tsx": "Auth gate that switches between login, signup, or profile setup based on identity and fetched user profile state.",
  "frontend/src/pages/auth/LoginPage.tsx": "Login page using Internet Identity with status handling and navigation after successful authentication.",
  "frontend/src/pages/auth/ProfileSetupPage.tsx": "Profile setup form that submits user details to the backend and redirects after creating a profile.",
  "frontend/src/pages/auth/SignupPage.tsx": "Signup page that triggers Internet Identity login and shows errors or loading state.",
  "frontend/src/pages/home/HomePage.tsx": "Home page showing the feed and a button to open the create‑post dialog.",
  "frontend/src/pages/messages/ConversationPage.tsx": "Conversation view that loads messages with a user, marks them read, and allows sending new messages.",
  "frontend/src/pages/messages/MessagesPage.tsx": "Messages list showing conversations and navigating to specific conversation threads.",
  "frontend/src/pages/notifications/NotificationsPage.tsx": "Displays user notifications, supports marking them as read, and shows loading skeletons or an empty state.",
  "frontend/src/pages/onboarding/OnboardingPage.tsx": "Renders a multi-step onboarding slideshow with images, navigation, and a final completion action.",
  "frontend/src/pages/profile/ProfilePage.tsx": "Loads and displays a user's profile and posts, with edit options for the owner and role badges for admins/owners.",
  "frontend/src/pages/search/SearchPage.tsx": "Provides a debounced search for users, showing loading states, results, or a no‑matches message and linking to profiles or messages.",
  "frontend/src/pages/settings/SettingsPage.tsx": "Shows user settings including profile, theme, logout, admin role management, and app lock controls.",
  "frontend/src/pages/stories/StoriesPage.tsx": "Lists active stories, allows creating a new story, and navigates to individual story views with a loading state.",
  "frontend/src/pages/stories/StoryViewerPage.tsx": "Full-screen story viewer that cycles through active stories with progress bars, navigation, and author info.",
  "frontend/src/utils/accessCodeGate.ts": "Manages app access lock state in localStorage and validates a fixed access code.",
  "frontend/src/utils/onboarding.ts": "Tracks whether onboarding has been completed using localStorage.",
  "frontend/src/utils/pwa.ts": "Registers a service worker, handles updates, and forces reloads when new workers activate.",
  "frontend/src/utils/startup.ts": "Provides startup phase tracking, timeout helpers, and error logging/classification utilities.",
  "frontend/src/utils/time.ts": "Formats timestamps and last‑seen values and checks if a user is considered online.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, shadows, and responsive utilities.",
  "project_state.json": "Project metadata describing deployment workflow, feature requests, and versioning state."
}