{
  "backend/main.mo": "Main backend canister defining user profiles, posts, stories, messages, notifications, announcements, and access control with storage mixins and comparison utilities.",
  "backend/migration.mo": "Migration module providing a no-op run function for initialization.",
  "feature_evidence.json": "Feature evidence report describing a frontend reliability feature with related files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing production failure causes, fixes, and pre-deployment checklist items.",
  "frontend/index.css": "Global Tailwind-based style definitions including theme variables and dark mode mappings.",
  "frontend/index.html": "HTML entry point setting metadata, manifest, icons, and bootstrapping the main script.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, colors, start URL, and icon assets.",
  "frontend/public/sw.js": "Service worker implementing resilient caching, versioned cache cleanup, fetch handling, and skip-waiting messaging.",
  "frontend/src/App.tsx": "Root React app configuring routes, shells, startup handling, authentication gates, and service worker registration.",
  "frontend/src/components/announcements/AnnouncementsBanner.tsx": "Fetches announcements and displays the latest one in a styled banner with timestamp.",
  "frontend/src/components/posts/CommentsDrawer.tsx": "Provides a slide-in drawer to view and submit comments on a post, including author info and validation.",
  "frontend/src/components/posts/CreatePostDialog.tsx": "Dialog for creating posts with text and optional media upload, including preview and progress tracking.",
  "frontend/src/components/posts/CreatePostFab.tsx": "Floating action button that opens the post creation dialog.",
  "frontend/src/components/posts/FeedList.tsx": "Loads and displays the full list of posts with loading, error, and refresh handling.",
  "frontend/src/components/posts/MediaPost.tsx": "Renders images or auto-playing videos with loading states and manual play controls.",
  "frontend/src/components/posts/PostCard.tsx": "Displays an individual post with author info, media, likes, comments, sharing, and delete actions.",
  "frontend/src/components/posts/TrendingPostsSection.tsx": "Shows top-liked posts as a trending list, with loading skeletons and fallback handling.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Dialog allowing users to edit profile fields and upload a new profile picture with progress tracking.",
  "frontend/src/components/stories/CreateStoryDialog.tsx": "Form for creating a new story with optional image upload and preview.",
  "frontend/src/components/stories/StoriesRow.tsx": "Displays a horizontal list of story bubbles grouped by author and includes a button to create new stories.",
  "frontend/src/components/system/ErrorBoundary.tsx": "Class-based boundary that catches rendering errors and shows a recovery screen.",
  "frontend/src/components/system/GlassSurface.tsx": "Reusable glass-style container components with variants for default, card, and navigation.",
  "frontend/src/components/system/NavIcon.tsx": "Navigation icon component that falls back to predefined icons when image loading fails.",
  "frontend/src/components/system/PageState.tsx": "Common UI states including loading indicators, error messages, empty states, and skeleton cards.",
  "frontend/src/components/system/PageTransition.tsx": "Wraps pages with a fade-in animation keyed to the current route.",
  "frontend/src/components/system/RoleBadge.tsx": "Renders decorative badges for admin and owner roles.",
  "frontend/src/components/system/SplashScreen.tsx": "Animated splash screen with branding shown on app launch.",
  "frontend/src/components/system/StartupScreen.tsx": "Displays startup progress phases and errors with retry support during app initialization.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook that creates and manages an authenticated or anonymous backend actor, invalidating related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling authentication, identity loading, and login state management.",
  "frontend/src/hooks/usePatchedActor.ts": "Similar to useActor but with retry logic, this hook creates a backend actor tied to the current identity and refreshes dependent queries.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and related backend data using the patched actor.",
  "frontend/src/index.css": "Tailwind-based global stylesheet defining a premium dark theme, gradients, and glassmorphism utility classes.",
  "frontend/src/layout/AppShell.tsx": "App layout component providing navigation, user profile info, unread counts, and periodic last‑seen updates.",
  "frontend/src/main.tsx": "Entry point that initializes React, sets up QueryClient, Internet Identity provider, and mounts the app.",
  "frontend/src/pages/access/AccessCodeGatePage.tsx": "Displays an access‑code gate UI that validates a code and unlocks the app upon success.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard that loads users, posts, stats and provides actions to ban/unban users, delete posts, and create announcements.",
  "frontend/src/pages/auth/AuthGate.tsx": "Authentication gate that switches between login, signup, and profile setup based on identity and profile fetch state.",
  "frontend/src/pages/auth/LoginPage.tsx": "Login screen using Internet Identity with loading state, error handling, and a link to switch to signup.",
  "frontend/src/pages/auth/ProfileSetupPage.tsx": "Profile setup form that submits user details to the backend and redirects to home after success.",
  "frontend/src/pages/auth/SignupPage.tsx": "Signup screen that triggers Internet Identity login and allows switching back to login.",
  "frontend/src/pages/home/HomePage.tsx": "Home feed page showing posts and a dialog trigger for creating a new post.",
  "frontend/src/pages/messages/ConversationPage.tsx": "Conversation view that loads messages, marks them as read, and allows sending new messages to a user.",
  "frontend/src/pages/messages/MessagesPage.tsx": "Messages overview listing all conversations and navigating to individual chat threads.",
  "frontend/src/pages/notifications/NotificationsPage.tsx": "Displays a notifications list with loading skeletons and allows marking notifications as read.",
  "frontend/src/pages/onboarding/OnboardingPage.tsx": "Shows a multi-slide onboarding flow with images, navigation, and a completion handler.",
  "frontend/src/pages/profile/ProfilePage.tsx": "Loads and displays a user's profile and posts with edit, messaging, and error handling states.",
  "frontend/src/pages/search/SearchPage.tsx": "Provides a debounced user search with results, loading skeletons, and navigation to profiles or messages.",
  "frontend/src/pages/settings/SettingsPage.tsx": "Shows user settings including profile info, theme selection, admin role management, and logout.",
  "frontend/src/pages/stories/StoriesPage.tsx": "Displays active stories, a create-story option, and handles story navigation with loading states.",
  "frontend/src/pages/stories/StoryViewerPage.tsx": "Story viewer UI that cycles through active stories with timed progress, navigation, and author header display.",
  "frontend/src/utils/accessCodeGate.ts": "Handles simple access-code lock state using localStorage with a hardcoded code check.",
  "frontend/src/utils/onboarding.ts": "Tracks onboarding completion state via localStorage.",
  "frontend/src/utils/pwa.ts": "Registers and manages service worker updates, including auto-reload on new worker activation.",
  "frontend/src/utils/startup.ts": "Provides startup phase tracking, timeout helpers, and detailed error classification/logging.",
  "frontend/src/utils/time.ts": "Formats timestamps for relative display and determines online status based on recency.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and persisting URL parameters across navigation using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and shadows.",
  "project_state.json": "Describes project state, issues, and feature requests related to profile loading and backend authorization."
}