{
  "backend/main.mo": "Defines the main canister with storage mixins, user profiles, posts, stories, messages, notifications, announcements, and related helper logic.",
  "feature_evidence.json": "Lists feature evidence entries linking feature requirements to affected frontend files and components with confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and behavior of key frontend files in the project.",
  "frontend/index.css": "Defines global Tailwind-based CSS variables and theming rules for light/dark modes.",
  "frontend/index.html": "Base HTML file that loads the React app root, metadata, icons, and main script entry point.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, start URL, and icons for installation.",
  "frontend/public/sw.js": "Service worker implementing caching for static assets, cache cleanup, and offline fallback behavior.",
  "frontend/src/App.tsx": "Main React app setup configuring routes, startup behavior, authentication gates, and global providers.",
  "frontend/src/components/announcements/AnnouncementsBanner.tsx": "UI component that fetches announcements and displays the latest one in a styled banner.",
  "frontend/src/components/posts/CommentsDrawer.tsx": "Drawer showing post comments, fetching author profiles and allowing users to submit new comments.",
  "frontend/src/components/posts/CreatePostDialog.tsx": "Dialog for creating a post with text and optional media upload, including preview and progress tracking.",
  "frontend/src/components/posts/CreatePostFab.tsx": "Floating action button that opens the create‑post dialog.",
  "frontend/src/components/posts/FeedList.tsx": "Fetches and displays the list of posts with loading, error, empty, and refresh states.",
  "frontend/src/components/posts/MediaPost.tsx": "Renders image or video media with loading skeletons and auto‑play behavior for videos.",
  "frontend/src/components/posts/PostCard.tsx": "Full post card showing author, content, media, like/delete actions, and comment drawer.",
  "frontend/src/components/posts/TrendingPostsSection.tsx": "Empty placeholder for a trending posts section.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Dialog to edit user profile fields and upload a new profile picture with preview and progress.",
  "frontend/src/components/stories/CreateStoryDialog.tsx": "Modal for creating a story with caption and optional image upload, handling previews, progress, and API submission.",
  "frontend/src/components/stories/StoriesRow.tsx": "Displays story bubbles grouped by author with a create-story button and navigation to story views.",
  "frontend/src/components/system/ErrorBoundary.tsx": "Class-based error boundary that shows a styled fallback UI with error details and a reset button.",
  "frontend/src/components/system/GlassSurface.tsx": "Provides glass-style container components with configurable variants for UI surfaces.",
  "frontend/src/components/system/NavIcon.tsx": "Renders an image icon with automatic fallback to Lucide icons on load failure.",
  "frontend/src/components/system/PageState.tsx": "Reusable loading, error, empty, and skeleton UI components for page states.",
  "frontend/src/components/system/PageTransition.tsx": "Wraps pages with a fade-in animation keyed to route changes.",
  "frontend/src/components/system/RoleBadge.tsx": "Displays a styled badge for admin or owner roles using themed icons and gradients.",
  "frontend/src/components/system/SplashScreen.tsx": "Full-screen animated splash screen showing the app logo and branding.",
  "frontend/src/components/system/StartupScreen.tsx": "Startup phase UI showing progress or errors with appropriate icons and retry handling.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to user identity, reinitializing on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status handling. Wraps AuthClient creation and exposes identity state to the app.",
  "frontend/src/hooks/usePatchedActor.ts": "Creates and caches an authenticated or anonymous backend actor based on the current identity. Automatically invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, admin checks, user search, and other backend data using the patched actor. Handles auth-aware query enabling, retries, and error cases.",
  "frontend/src/index.css": "Configures Tailwind and defines a dark glassmorphism theme with custom variables, gradients, and utility classes. Applies global base styling and premium UI effects.",
  "frontend/src/layout/AppShell.tsx": "Implements the main authenticated app layout with navigation, user profile integration, unread counts, and periodic last-seen updates. Renders responsive nav content and wraps page children.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting it with QueryClientProvider and InternetIdentityProvider. Loads global CSS and renders the main App component.",
  "frontend/src/pages/access/AccessCodeGatePage.tsx": "Renders a locked access-code gate UI that validates a user-entered code before unlocking the app. Manages input, error handling, and submission states.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard page that fetches users, posts, and stats, providing actions for banning users, deleting posts, and creating announcements.",
  "frontend/src/pages/auth/AuthGate.tsx": "Controls routing between login, signup, and profile setup based on authentication and profile state.",
  "frontend/src/pages/auth/LoginPage.tsx": "Login screen that triggers Internet Identity authentication and redirects on success.",
  "frontend/src/pages/auth/ProfileSetupPage.tsx": "Form for new users to submit name, class, and year, completing their profile setup via backend signup.",
  "frontend/src/pages/auth/SignupPage.tsx": "Signup screen that initiates Internet Identity login and allows switching back to login.",
  "frontend/src/pages/home/HomePage.tsx": "Home feed page displaying posts and providing a dialog to create new posts.",
  "frontend/src/pages/messages/ConversationPage.tsx": "Conversation view showing message history with a user, supporting sending messages and marking them as read.",
  "frontend/src/pages/messages/MessagesPage.tsx": "Messages overview listing conversations and navigating into individual chats.",
  "frontend/src/pages/notifications/NotificationsPage.tsx": "Displays user notifications, handles marking them as read, and shows loading or empty states.",
  "frontend/src/pages/onboarding/OnboardingPage.tsx": "Implements a multi-slide onboarding flow with images, navigation, and completion handling.",
  "frontend/src/pages/profile/ProfilePage.tsx": "Shows a user's profile with avatar, role badge, bio, posts, and edit or message actions depending on ownership.",
  "frontend/src/pages/search/SearchPage.tsx": "Provides a debounced user search with results, loading skeletons, and navigation to profiles or messages.",
  "frontend/src/pages/settings/SettingsPage.tsx": "Renders settings for profile management, theme switching, admin role controls, and logout features.",
  "frontend/src/pages/stories/StoriesPage.tsx": "Displays active stories, allows creating new ones, and navigates to individual story views.",
  "frontend/src/pages/stories/StoryViewerPage.tsx": "Implements a fullscreen story viewer with timed progress bars, navigation between stories, and author info display.",
  "frontend/src/utils/accessCodeGate.ts": "Provides localStorage utilities to validate, unlock, and lock the app using a fixed access code.",
  "frontend/src/utils/onboarding.ts": "Tracks onboarding completion status in localStorage with simple read/write helpers.",
  "frontend/src/utils/pwa.ts": "Registers a service worker on page load and logs update availability or registration errors.",
  "frontend/src/utils/startup.ts": "Defines startup phases and error handling helpers, including timeouts, logging, and error classification.",
  "frontend/src/utils/time.ts": "Formats timestamps into relative time strings and determines online status based on recent activity.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and shadows for the frontend UI theme.",
  "project_state.json": "Describes project state, known issues, and existing feature requirements for fixing intermittent profile load errors."
}