{
  "backend/main.mo": "Motoko canister defining storage mixins and data models for users, posts, stories, messages, notifications, and announcements with helpers for timestamps and role checks.",
  "feature_evidence.json": "Feature evidence report listing recent frontend changes related to actor initialization fixes and routing updates.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing UI behavior, components, hooks, and page logic.",
  "frontend/index.css": "Tailwind base styles and OKLCH theme variables for light and dark modes with global background/foreground setup.",
  "frontend/index.html": "Basic HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Main React router configuration and app bootstrap logic using patched actors, startup phases, and authenticated route handling.",
  "frontend/src/components/announcements/AnnouncementsBanner.tsx": "UI banner fetching and displaying the latest announcement inside a styled GlassCard.",
  "frontend/src/components/posts/CommentsDrawer.tsx": "Drawer UI for viewing and adding comments to a post with author lookup, formatting, and submit handling.",
  "frontend/src/components/posts/CreatePostDialog.tsx": "Dialog for creating posts with text and optional media upload, including previews and upload progress.",
  "frontend/src/components/posts/CreatePostFab.tsx": "Floating action button that triggers the create-post dialog.",
  "frontend/src/components/posts/FeedList.tsx": "Fetches and displays the feed of posts with loading, error, empty states, and manual refresh.",
  "frontend/src/components/posts/MediaPost.tsx": "Displays image or video media with loading skeletons and auto-play controls for videos.",
  "frontend/src/components/posts/PostCard.tsx": "Renders an individual post with author info, likes, delete controls, media, and comments drawer.",
  "frontend/src/components/posts/TrendingPostsSection.tsx": "Empty placeholder component for trending posts.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Dialog for editing user profile fields and uploading a new profile picture with progress.",
  "frontend/src/components/stories/CreateStoryDialog.tsx": "Dialog for creating a story with caption text and optional image upload and preview.",
  "frontend/src/components/stories/StoriesRow.tsx": "Displays story bubbles grouped by author and includes a create-story button with dialog handling.",
  "frontend/src/components/system/ErrorBoundary.tsx": "A React error boundary that shows a styled fallback UI and resets to home on error.",
  "frontend/src/components/system/GlassSurface.tsx": "Provides reusable glass-style surface wrappers with variant styling including a card version.",
  "frontend/src/components/system/NavIcon.tsx": "Renders an image icon with automatic fallback to Lucide icons when loading fails.",
  "frontend/src/components/system/PageState.tsx": "Defines loading, error, empty, and skeleton UI states for pages and cards.",
  "frontend/src/components/system/PageTransition.tsx": "Wraps pages with a fade-in animation keyed to the current route.",
  "frontend/src/components/system/RoleBadge.tsx": "Displays styled badges for admin or owner roles using icon indicators.",
  "frontend/src/components/system/SplashScreen.tsx": "Shows an animated startup splash screen with logo and branding.",
  "frontend/src/components/system/StartupScreen.tsx": "Displays startup phase progress or an error screen with retry during app initialization.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities, and login/logout methods.",
  "frontend/src/hooks/usePatchedActor.ts": "Creates a backend actor without access-control initialization and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, posts, admin actions, and various backend data via a patched actor.",
  "frontend/src/index.css": "Configures Tailwind CSS with a dark glassmorphism theme, custom variables, and gradient-based utility classes.",
  "frontend/src/layout/AppShell.tsx": "Implements the main app layout with navigation, user profile data, unread notifications, and periodic last‑seen updates.",
  "frontend/src/main.tsx": "Bootstraps the React app, providing React Query and Internet Identity context providers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard page that displays stats, manages users and posts, and allows creating announcements.",
  "frontend/src/pages/auth/AuthGate.tsx": "Determines whether to show login, signup, or profile setup based on identity and user profile status.",
  "frontend/src/pages/auth/LoginPage.tsx": "Login page that authenticates the user via Internet Identity and provides UI for switching to signup.",
  "frontend/src/pages/auth/ProfileSetupPage.tsx": "Form page for creating a user profile with validation and backend signup request.",
  "frontend/src/pages/auth/SignupPage.tsx": "Signup screen using Internet Identity login with loading and error states.",
  "frontend/src/pages/home/HomePage.tsx": "Home feed showing posts and a button to open the create-post dialog.",
  "frontend/src/pages/messages/ConversationPage.tsx": "Conversation view displaying messages, sending new messages, and marking received messages as read.",
  "frontend/src/pages/messages/MessagesPage.tsx": "Lists all conversations with previews and links to individual message threads.",
  "frontend/src/pages/notifications/NotificationsPage.tsx": "Displays notifications with timestamps and marks unread items as read on click.",
  "frontend/src/pages/onboarding/OnboardingPage.tsx": "Multi-step onboarding slides with navigation and a final completion handler.",
  "frontend/src/pages/profile/ProfilePage.tsx": "Displays a user profile with avatar, role badge, bio, posts, and edit or message actions, loading states, and not-found handling.",
  "frontend/src/pages/search/SearchPage.tsx": "Provides a debounced student search UI with results, loading skeletons, navigation to profiles, and quick messaging.",
  "frontend/src/pages/settings/SettingsPage.tsx": "Renders user settings including profile info, theme switching, logout, and admin role management for eligible users.",
  "frontend/src/pages/stories/StoriesPage.tsx": "Shows a grid of active stories, allows creating new stories, and links to individual story viewers with loading states.",
  "frontend/src/pages/stories/StoryViewerPage.tsx": "Displays full-screen story viewer with progress bars, author info, auto‑advance, and navigation between stories.",
  "frontend/src/utils/onboarding.ts": "Handles reading and writing onboarding completion state from localStorage with safe fallbacks.",
  "frontend/src/utils/startup.ts": "Provides startup-phase logging plus utilities for timeouts, promise racing, and structured startup error reporting.",
  "frontend/src/utils/time.ts": "Formats timestamps for stories and user activity, including relative times and online-status checks.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and remove them from URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes project state and notes a startup hang caused by a missing backend method call."
}