{
  "kind": "build_request",
  "title": "Fix intermittent “Unable to load profile” startup error",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the startup/auth flow so the app does not get stuck on a startup error when the current user profile fetch fails intermittently; the user must be able to retry successfully without a full page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "It's saying unable to load profile again fix this"
        ]
      },
      "acceptanceCriteria": [
        "When an authenticated user hits an intermittent profile-load failure, the app shows a startup error state with a working Retry action (no hard refresh required).",
        "Clicking Retry re-attempts both actor initialization and the current user profile query and can recover to a usable app state when the network/backend is available.",
        "The app does not incorrectly show the error screen for unauthenticated users; unauthenticated users must continue to see the normal auth gate flow."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make the current-user profile React Query hook resilient to transient errors by avoiding throwing 'Actor not available' from the profile query function, and by using a limited retry policy for network/transient failures while keeping the missing-profile case as a successful null result.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "It's saying unable to load profile again fix this"
        ]
      },
      "acceptanceCriteria": [
        "`useGetCallerUserProfile` no longer produces an error solely due to a short-lived actor unavailability during identity/actor transitions.",
        "A missing profile still resolves as `null` (not an error) so the app can route to Profile Setup as intended.",
        "Transient failures (e.g., agent/network) are retried a small number of times with a short delay, and if still failing, the app surfaces the startup error with Retry."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve diagnostics for profile-load failures without blocking valid flows: log the underlying error details in development and show a clear, user-facing English error message that distinguishes backend connection issues vs profile loading issues.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "It's saying unable to load profile again fix this"
        ]
      },
      "acceptanceCriteria": [
        "In development, console output includes the startup phase and the underlying exception details when profile loading fails.",
        "The startup error screen message is in English and actionable (e.g., suggests retrying/checking connection) and does not leak raw stack traces to users.",
        "The Retry action triggers the same recovery behavior as REQ-1 and clears the previous startup error state."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only UI components).",
    "Do not modify immutable hook/bootstrap files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if state schema changes (not expected for this fix)."
  ],
  "nonGoals": [
    "Adding new authentication providers (only Internet Identity).",
    "Adding new backend data models or changing user profile schema.",
    "Implementing real-time updates (no websockets)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}