{
  "kind": "build_request",
  "title": "Fix startup hang on “Connecting to backend” by removing missing admin init call",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Stop frontend startup from calling the missing backend method `_initializeAccessControlWithSecret` so authenticated users no longer get stuck on the “Connecting to backend…” startup phase.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "It stuck in loding it says connection to backend and stuck",
          "Ok do it"
        ]
      },
      "acceptanceCriteria": [
        "When logged in, the app progresses past “Connecting to backend…” and reaches AuthGate / main app routes without hanging.",
        "No runtime call is made to `actor._initializeAccessControlWithSecret(...)` during actor creation.",
        "No TypeScript build errors occur due to references to `_initializeAccessControlWithSecret` or unused admin-token utilities."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Because `frontend/src/hooks/useActor.ts` is immutable, implement a new non-immutable actor hook that creates the backend actor (anonymous and authenticated) without calling `_initializeAccessControlWithSecret`, and update all editable frontend modules to import and use the new hook instead of `useActor`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "I suggest the simplest and safest option: remove the frontend call to _initializeAccessControlWithSecret.",
          "Ok do it"
        ]
      },
      "acceptanceCriteria": [
        "A new hook file (in a non-immutable path) provides `{ actor, isFetching }` with the same shape currently expected by the app.",
        "`frontend/src/App.tsx` uses the new hook for backend connection state (actor presence) so the startup phase logic works correctly.",
        "`frontend/src/hooks/useQueries.ts` (and any other editable files that currently import `useActor`) are updated to use the new hook, ensuring all backend calls use the patched actor instance.",
        "The app behaves the same as before for anonymous users (anonymous actor still created), except it no longer hangs during backend connection."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/hooks/useActor.ts`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything under `frontend/src/components/ui` (immutable paths).",
    "Do not add a new backend method `_initializeAccessControlWithSecret`; the fix must be frontend-only.",
    "Backend must remain single-actor (all Motoko logic stays in `backend/main.mo`), and no state migration is required for this change."
  ],
  "nonGoals": [
    "Implementing or reintroducing admin-mode initialization via a secret token.",
    "Changing authentication (Internet Identity) behavior.",
    "Redesigning the startup UI beyond what is necessary to verify the hang is resolved."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}