{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove missing admin init call from frontend actor creation to fix startup hang",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Prevent the app startup flow from invoking the missing backend method `_initializeAccessControlWithSecret` so authenticated users do not hang on “Connecting to backend…”.",
      "acceptanceCriteria": [
        "When logged in, the app progresses past “Connecting to backend…” and reaches AuthGate / main app routes without hanging.",
        "No runtime call is made to `actor._initializeAccessControlWithSecret(...)` during actor creation.",
        "No TypeScript build errors occur due to references to `_initializeAccessControlWithSecret` or unused admin-token utilities."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Switch startup/backend-connection state to use the new patched actor hook (instead of the immutable `useActor`) so authenticated startup no longer triggers `_initializeAccessControlWithSecret`."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a new editable actor hook that creates anonymous/authenticated backend actors without `_initializeAccessControlWithSecret`, and update all editable imports to use it instead of `useActor`.",
      "acceptanceCriteria": [
        "A new hook file (in a non-immutable path) provides `{ actor, isFetching }` with the same shape currently expected by the app.",
        "`frontend/src/App.tsx` uses the new hook for backend connection state (actor presence) so the startup phase logic works correctly.",
        "`frontend/src/hooks/useQueries.ts` (and any other editable files that currently import `useActor`) are updated to use the new hook, ensuring all backend calls use the patched actor instance.",
        "The app behaves the same as before for anonymous users (anonymous actor still created), except it no longer hangs during backend connection."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePatchedActor.ts",
          "operation": "create",
          "description": "Create a new non-immutable React hook that mirrors the existing `{ actor, isFetching }` shape, creates an anonymous actor when not authenticated, creates an authenticated actor when identity exists, and explicitly does not call `_initializeAccessControlWithSecret` or any admin-token utility. Use existing actor creation infrastructure (e.g., `createActorWithConfig`) and keep React Query cache keying consistent with identity changes."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Replace imports/usage of the immutable `useActor` with the new patched actor hook so all React Query hooks use the patched actor instance for backend calls."
        },
        {
          "path": "frontend/src/pages/auth/ProfileSetupPage.tsx",
          "operation": "modify",
          "description": "Update to use the new patched actor hook instead of importing `useActor`, ensuring signup/profile setup uses the patched actor instance."
        }
      ]
    }
  ]
}